{"data":[
  {
    "head": "What is camping trek",
    "data": "Camping treks are treks in which you spend your night in tents.Tents are pitched in a location which meets the basic requirements of a camping ground like source of water, safety from rocakfall,flash floods, etc, good views to mention a few."
  },
  {
    "head": "What is trekking",
    "data": "Trekking is an interesting walking holidays;adventurous journey to discover the diversity of nature and culture by foot on hills or High Mountain areas is called trekking"
  },
  {
"head":"Why should I go to the Himalayas",
"data":"A Renowned Spiritual Center To the spiritually inclined, the Himalayas is considered a sacred region.There are sacred places, temples, ashrams, and pilgrimage routes from one end to the other, including the foothill"
},
  {
"head":"What is the best time for trekking",
"data":"The best time for trekking can be subjective to your taste. Each season brings a different experience to various aspects of the journey. Spring (March, April, May) are ideal for forested journeys as entire forests are covered with rhododendrons blooming in shades of red, pink, and white. The rainy seasons of June, July and August are often avoided as the chances of landslide increases drastically in the Himalayas. The autumn months of September to November are favored by trekkers where in addition to a lovely trek they get to enjoy the vibrant festivals of Dashain and Tihar. During the winter months from December and February, the temperature in the Himalayas decreases drastically and treks into the mountains are often avoided during the season."
},
  {
"head":"What kind of clothes is needed for trekking","data":"The clothes needed for trekking entirely depends on the destination of the trek and the season of your trek. If you are heading to the Himalayas, regardless of the season, make sure to have warm clothes including thermals, down jackets, and woolen clothes. However, if you are journeying to the Terai cities temperatures soar during the summer months and cotton clothes are ideal. During the winter months, the Terai regions experience a lot of fogs so pack a jacket and some woolen clothes. The hilly regions experience moderate temperature and a couple of layers is enough to get you through your travel. Make sure the clothing you wear is comfortable and doesn’t restrict mobility."
  }
]
}
  
 